nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/mcuxpresso/startup_mimxrt798s_cm33_core1.cpp
//*****************************************************************************
// MIMXRT798S_cm33_core1 startup code for use with MCUXpresso IDE
//
// Version : 280524
//*****************************************************************************
//
// Copyright 2016-2024 NXP
// All rights reserved.
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************

#if defined (DEBUG)
#pragma GCC push_options
#pragma GCC optimize ("Og")
#endif // (DEBUG)

#if defined (__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
    extern void __libc_init_array(void);
}
#endif
#endif

#define WEAK __attribute__ ((weak))
#define WEAK_AV __attribute__ ((weak, section(".after_vectors")))
#define ALIAS(f) __attribute__ ((weak, alias (#f)))

//*****************************************************************************
#if defined (__cplusplus)
extern "C" {
#endif

//*****************************************************************************
// Variable to store CRP value in. Will be placed automatically
// by the linker when "Enable Code Read Protect" selected.
// See crp.h header for more information
//*****************************************************************************
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
#if defined (__USE_CMSIS)
extern void SystemInit(void);
#endif // (__USE_CMSIS)

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
     void ResetISR(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SecureFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void IntDefaultHandler(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void Reserved16_IRQHandler(void);
WEAK void Reserved17_IRQHandler(void);
WEAK void Reserved18_IRQHandler(void);
WEAK void FRO2_IRQHandler(void);
WEAK void GLIKEY4_IRQHandler(void);
WEAK void UTICK1_IRQHandler(void);
WEAK void MRT1_IRQHandler(void);
WEAK void CTIMER5_IRQHandler(void);
WEAK void CTIMER6_IRQHandler(void);
WEAK void CTIMER7_IRQHandler(void);
WEAK void LPI2C15_IRQHandler(void);
WEAK void LP_FLEXCOMM17_IRQHandler(void);
WEAK void LP_FLEXCOMM18_IRQHandler(void);
WEAK void LP_FLEXCOMM19_IRQHandler(void);
WEAK void LP_FLEXCOMM20_IRQHandler(void);
WEAK void ADC_IRQHandler(void);
WEAK void SDADC_IRQHandler(void);
WEAK void GLIKEY1_IRQHandler(void);
WEAK void ACMP_IRQHandler(void);
WEAK void PDM_EVENT_IRQHandler(void);
WEAK void HYPERVISOR_IRQHandler(void);
WEAK void SECURE_VIOLATION_IRQHandler(void);
WEAK void PDM_HWVAD_EVENT_IRQHandler(void);
WEAK void RTC1_ALARM_IRQHandler(void);
WEAK void RTC1_IRQHandler(void);
WEAK void HIFI1_IRQHandler(void);
WEAK void MU1_B_IRQHandler(void);
WEAK void MU2_B_IRQHandler(void);
WEAK void MU3_A_IRQHandler(void);
WEAK void PMC_IRQHandler(void);
WEAK void OS_EVENT_IRQHandler(void);
WEAK void USDHC0_IRQHandler(void);
WEAK void USDHC1_IRQHandler(void);
WEAK void I3C2_IRQHandler(void);
WEAK void USB0_IRQHandler(void);
WEAK void USB1_IRQHandler(void);
WEAK void WDT2_IRQHandler(void);
WEAK void WDT3_IRQHandler(void);
WEAK void USBPHY0_IRQHandler(void);
WEAK void PMIC_IRQN_IRQHandler(void);
WEAK void I3C3_IRQHandler(void);
WEAK void FLEXIO_IRQHandler(void);
WEAK void LCDIF_IRQHandler(void);
WEAK void VGPU_IRQHandler(void);
WEAK void MIPI_IRQHandler(void);
WEAK void EDMA2_CH0_IRQHandler(void);
WEAK void EDMA2_CH1_IRQHandler(void);
WEAK void EDMA2_CH2_IRQHandler(void);
WEAK void EDMA2_CH3_IRQHandler(void);
WEAK void EDMA2_CH4_IRQHandler(void);
WEAK void EDMA2_CH5_IRQHandler(void);
WEAK void EDMA2_CH6_IRQHandler(void);
WEAK void EDMA2_CH7_IRQHandler(void);
WEAK void EDMA3_CH0_IRQHandler(void);
WEAK void EDMA3_CH1_IRQHandler(void);
WEAK void EDMA3_CH2_IRQHandler(void);
WEAK void EDMA3_CH3_IRQHandler(void);
WEAK void EDMA3_CH4_IRQHandler(void);
WEAK void EDMA3_CH5_IRQHandler(void);
WEAK void EDMA3_CH6_IRQHandler(void);
WEAK void EDMA3_CH7_IRQHandler(void);
WEAK void GPIO80_IRQHandler(void);
WEAK void GPIO81_IRQHandler(void);
WEAK void GPIO90_IRQHandler(void);
WEAK void GPIO91_IRQHandler(void);
WEAK void GPIO100_IRQHandler(void);
WEAK void GPIO101_IRQHandler(void);
WEAK void Reserved83_IRQHandler(void);
WEAK void Reserved84_IRQHandler(void);
WEAK void PIN_INT0_IRQHandler(void);
WEAK void PIN_INT1_IRQHandler(void);
WEAK void PIN_INT2_IRQHandler(void);
WEAK void PIN_INT3_IRQHandler(void);
WEAK void SAI3_IRQHandler(void);
WEAK void XSPI2_IRQHandler(void);
WEAK void MMU2_IRQHandler(void);
WEAK void GDET2_IRQHandler(void);
WEAK void GDET3_IRQHandler(void);
WEAK void CDOG3_IRQHandler(void);
WEAK void CDOG4_IRQHandler(void);
WEAK void Reserved96_IRQHandler(void);
WEAK void CPU1_IRQHandler(void);
WEAK void JPEGDEC_IRQHandler(void);
WEAK void PNGDEC_IRQHandler(void);
WEAK void Reserved100_IRQHandler(void);
WEAK void TEMPDET0_IRQHandler(void);
WEAK void TEMPDET1_IRQHandler(void);
WEAK void EZHV_IRQHandler(void);
WEAK void SLEEPCON1_IRQHandler(void);
WEAK void PVTS1_CPU1_IRQHandler(void);
WEAK void Reserved106_IRQHandler(void);
WEAK void PVTS1_HIFI1_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the IntDefaultHandler, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void Reserved16_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved17_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved18_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FRO2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GLIKEY4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void UTICK1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MRT1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CTIMER5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CTIMER6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CTIMER7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C15_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM17_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM18_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM19_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM20_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SDADC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GLIKEY1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ACMP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_EVENT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void HYPERVISOR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SECURE_VIOLATION_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_HWVAD_EVENT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTC1_ALARM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void HIFI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MU1_B_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MU2_B_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MU3_A_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PMC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void OS_EVENT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USDHC0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USDHC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void I3C2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USB0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USB1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void WDT2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void WDT3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USBPHY0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PMIC_IRQN_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void I3C3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXIO_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LCDIF_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void VGPU_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MIPI_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA2_CH0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA2_CH1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA2_CH2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA2_CH3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA2_CH4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA2_CH5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA2_CH6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA2_CH7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA3_CH0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA3_CH1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA3_CH2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA3_CH3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA3_CH4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA3_CH5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA3_CH6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA3_CH7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO80_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO81_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO90_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO91_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO100_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO101_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved83_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved84_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void XSPI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MMU2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GDET2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GDET3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CDOG3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CDOG4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved96_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CPU1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void JPEGDEC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PNGDEC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved100_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TEMPDET0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TEMPDET1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EZHV_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SLEEPCON1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PVTS1_CPU1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved106_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PVTS1_HIFI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined (__REDLIB__)
extern void __main(void);
#endif
extern int main(void);

//*****************************************************************************
// External declaration for the pointer to the stack top from the Linker Script
//*****************************************************************************
extern void _vStackTop(void);
extern void _image_size(void);
//*****************************************************************************
// External declaration for the pointer to the stack base from the Linker Script
//*****************************************************************************
extern void _vStackBase(void);
//*****************************************************************************
// External declaration for image type and load address from  Linker Script
//*****************************************************************************
WEAK extern void __imghdr_loadaddress();
WEAK extern void __imghdr_imagetype();

//*****************************************************************************
#if defined (__cplusplus)
} // extern "C"
#endif
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************

