nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/mcuxpresso/startup_mimxrt798s_cm33_core1.cpp
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM33
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // NMI Handler
    HardFault_Handler,                 // Hard Fault Handler
    MemManage_Handler,                 // MPU Fault Handler
    BusFault_Handler,                  // Bus Fault Handler
    UsageFault_Handler,                // Usage Fault Handler
    SecureFault_Handler,               // Secure Fault Handler
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
    (void (*)())0x180000,                // Image length
#else
    (void (*)())((unsigned)_image_size), // Image length
#endif
    __imghdr_imagetype,                // Image type
    0,                                 // Reserved
    SVC_Handler,                       // SVCall Handler
    DebugMon_Handler,                  // Debug Monitor Handler
    (void (*)())g_pfnVectors,          // Image load address
    PendSV_Handler,                    // PendSV Handler
    SysTick_Handler,                   // SysTick Handler

    // Chip Level - MIMXRT798S_cm33_core1
    Reserved16_IRQHandler,        // 16 : Reserved interrupt
    Reserved17_IRQHandler,        // 17 : Reserved interrupt
    Reserved18_IRQHandler,        // 18 : Reserved interrupt
    FRO2_IRQHandler,              // 19 : FRO: 300MHz FRO in VDD1 domain Async interrupt
    GLIKEY4_IRQHandler,           // 20 : GLIKEY: Interrupt
    UTICK1_IRQHandler,            // 21 : Micro-tick Timer
    MRT1_IRQHandler,              // 22 : MRT: Ored Interrupt request
    CTIMER5_IRQHandler,           // 23 : CTIMER: Interrupt request
    CTIMER6_IRQHandler,           // 24 : CTIMER: Interrupt request
    CTIMER7_IRQHandler,           // 25 : CTIMER: Interrupt request
    LPI2C15_IRQHandler,           // 26 : LPI2C: Interrupt request
    LP_FLEXCOMM17_IRQHandler,     // 27 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM18_IRQHandler,     // 28 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM19_IRQHandler,     // 29 : FLEXCOMM: Interrupt request
    LP_FLEXCOMM20_IRQHandler,     // 30 : FLEXCOMM: Interrupt request
    ADC_IRQHandler,               // 31 : ADC0: Interrupt request
    SDADC_IRQHandler,             // 32 : SDADC0: Interrupt request
    GLIKEY1_IRQHandler,           // 33 : GLIKEY: Interrupt
    ACMP_IRQHandler,              // 34 : ACMP: interrupt request
    PDM_EVENT_IRQHandler,         // 35 : MIC: Interrupt request for read data or Error
    HYPERVISOR_IRQHandler,        // 36 : SECURE: Sense domain Hypervisor interrupt
    SECURE_VIOLATION_IRQHandler,  // 37 : SECURE: Sense domain Secure violation interrupt
    PDM_HWVAD_EVENT_IRQHandler,   // 38 : MIC: Hardware Voice Activity Detector interrupt or error interrupt
    RTC1_ALARM_IRQHandler,        // 39 : RTC: Alarm interrupt
    RTC1_IRQHandler,              // 40 : RTC: wakeup interrupt to Sense domain
    HIFI1_IRQHandler,             // 41 : HIFI1: Interrupt request
    MU1_B_IRQHandler,             // 42 : MU1: MUB, CPU1 to CPU0
    MU2_B_IRQHandler,             // 43 : MU2: MUB, CPU1  to HiFi4
    MU3_A_IRQHandler,             // 44 : MU3: MUA, CPU1 to HiFi1
    PMC_IRQHandler,               // 45 : PMC: Sense domain Interrupt
    OS_EVENT_IRQHandler,          // 46 : OSEVENT: Event timer CPU1 Wakeup/interrupt
    USDHC0_IRQHandler,            // 47 : USDHC: Interrupt request
    USDHC1_IRQHandler,            // 48 : USDHC: Interrupt request
    I3C2_IRQHandler,              // 49 : I3C: Interrupt Request
    USB0_IRQHandler,              // 50 : USB: HSUSB Interrup request
    USB1_IRQHandler,              // 51 : USB: eUSB Interrup request
    WDT2_IRQHandler,              // 52 : WDT: Interrupt request
    WDT3_IRQHandler,              // 53 : WDT: Interrupt request
    USBPHY0_IRQHandler,           // 54 : HSUSBPHY: UTM interrupt request
    PMIC_IRQN_IRQHandler,         // 55 : PMIC: External PMIC interrupt
    I3C3_IRQHandler,              // 56 : I3C: Interrupt Request
    FLEXIO_IRQHandler,            // 57 : flexio: Interrupt request
    LCDIF_IRQHandler,             // 58 : dcn: Interrupt request
    VGPU_IRQHandler,              // 59 : VGPU interrupt from graphics core
    MIPI_IRQHandler,              // 60 : dsi: Interrupt request
    EDMA2_CH0_IRQHandler,         // 61 : edma2: Channel 0 interrupt
    EDMA2_CH1_IRQHandler,         // 62 : edma2: Channel 1 interrupt
    EDMA2_CH2_IRQHandler,         // 63 : edma2: Channel 2 interrupt
    EDMA2_CH3_IRQHandler,         // 64 : edma2: Channel 3 interrupt
    EDMA2_CH4_IRQHandler,         // 65 : edma2: Channel 4 interrupt
    EDMA2_CH5_IRQHandler,         // 66 : edma2: Channel 5 interrupt
    EDMA2_CH6_IRQHandler,         // 67 : edma2: Channel 6 interrupt
    EDMA2_CH7_IRQHandler,         // 68 : edma2: Channel 7 interrupt
    EDMA3_CH0_IRQHandler,         // 69 : edma3: Channel 0 interrupt
    EDMA3_CH1_IRQHandler,         // 70 : edma3: Channel 1 interrupt
    EDMA3_CH2_IRQHandler,         // 71 : edma3: Channel 2 interrupt
    EDMA3_CH3_IRQHandler,         // 72 : edma3: Channel 3 interrupt
    EDMA3_CH4_IRQHandler,         // 73 : edma3: Channel 4 interrupt
    EDMA3_CH5_IRQHandler,         // 74 : edma3: Channel 5 interrupt
    EDMA3_CH6_IRQHandler,         // 75 : edma3: Channel 6 interrupt
    EDMA3_CH7_IRQHandler,         // 76 : edma3: Channel 7 interrupt
    GPIO80_IRQHandler,            // 77 : rgpio8: Interupt request, channel 0
    GPIO81_IRQHandler,            // 78 : rgpio8: Interupt request, channel 1
    GPIO90_IRQHandler,            // 79 : rgpio9: Interupt request, channel 0
    GPIO91_IRQHandler,            // 80 : rgpio9: Interupt request, channel 1
    GPIO100_IRQHandler,           // 81 : rgpio10: Interupt request, channel 0
    GPIO101_IRQHandler,           // 82 : rgpio10: Interupt request, channel 1
    Reserved83_IRQHandler,        // 83 : Reserved interrupt
    Reserved84_IRQHandler,        // 84 : Reserved interrupt
    PIN_INT0_IRQHandler,          // 85 : pint1: Interupt request 0
    PIN_INT1_IRQHandler,          // 86 : pint1: Interupt request 1
    PIN_INT2_IRQHandler,          // 87 : pint1: Interupt request 2
    PIN_INT3_IRQHandler,          // 88 : pint1: Interupt request 3
    SAI3_IRQHandler,              // 89 : sai3: TX/RX interrupt
    XSPI2_IRQHandler,             // 90 : xspi2: Ored interrupt
    MMU2_IRQHandler,              // 91 : mmu2: Interrupt request
    GDET2_IRQHandler,             // 92 : gdet2_wrapper: Interrupt request
    GDET3_IRQHandler,             // 93 : gdet3_wrapper: Interrupt request
    CDOG3_IRQHandler,             // 94 : cdog3: Interrupt request
    CDOG4_IRQHandler,             // 95 : cdog4: Interrupt request
    Reserved96_IRQHandler,        // 96 : Reserved interrupt
    CPU1_IRQHandler,              // 97 : CTI interrupt request
    JPEGDEC_IRQHandler,           // 98 : JPEGDEC Ored context 0-3 interrupt request
    PNGDEC_IRQHandler,            // 99 : PNGDEC interrupt request
    Reserved100_IRQHandler,       // 100: Reserved interrupt
    TEMPDET0_IRQHandler,          // 101: TEMPDET0: Temperature Detect Interrupt request 0
    TEMPDET1_IRQHandler,          // 102: TEMPDET1: Temperature Detect Interrupt request 1
    EZHV_IRQHandler,              // 103: ezhv: Interrupt request
    SLEEPCON1_IRQHandler,         // 104: SLEEPCON_SENSE CPU1 wakeup event
    PVTS1_CPU1_IRQHandler,        // 105: PVTS1 CPU1 interrupt
    Reserved106_IRQHandler,       // 106: Reserved interrupt
    PVTS1_HIFI1_IRQHandler,       // 107: PVTS1 HIFI1 interrupt
}; /* End of g_pfnVectors */

#if defined(ENABLE_RAM_VECTOR_TABLE)
extern void * __VECTOR_TABLE __attribute__ ((alias ("g_pfnVectors")));
void (* __VECTOR_RAM[sizeof(g_pfnVectors) / 4])(void) __attribute__((aligned(128)));
unsigned int __RAM_VECTOR_TABLE_SIZE_BYTES = sizeof(g_pfnVectors);
#endif

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {
    // Disable interrupts
    __asm volatile ("cpsid i");
    // Config VTOR & MSPLIM register
    __asm volatile ("LDR R0, =0xE000ED08  \n"
                    "STR %0, [R0]         \n"
                    "LDR R1, [%0]         \n"
                    "MSR MSP, R1          \n"
                    "MSR MSPLIM, %1       \n"
                    :
                    : "r"(g_pfnVectors), "r"(_vStackBase)
                    : "r0", "r1");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

