nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/mcuxpresso/startup_mimxrt798s_cm33_core1.cpp
    // Load base address of Global Section Table
    SectionTableAddr = &__data_section_table;

    // Copy the data sections from flash to SRAM.
    while (SectionTableAddr < &__data_section_table_end) {
        LoadAddr = *SectionTableAddr++;
        ExeAddr = *SectionTableAddr++;
        SectionLen = *SectionTableAddr++;
        data_init(LoadAddr, ExeAddr, SectionLen);
    }

    // At this point, SectionTableAddr = &__bss_section_table;
    // Zero fill the bss segment
    while (SectionTableAddr < &__bss_section_table_end) {
        ExeAddr = *SectionTableAddr++;
        SectionLen = *SectionTableAddr++;
        bss_init(ExeAddr, SectionLen);
    }

#if defined (__cplusplus)
    //
    // Call C++ library initialisation
    //
    __libc_init_array();
#endif

    // Reenable interrupts
    __asm volatile ("cpsie i");

#if defined (__REDLIB__)
    // Call the Redlib library, which in turn calls main()
    __main();
#else
    main();
#endif

    //
    // main() shouldn't return, but if it does, we'll just enter an infinite loop
    //
    while (1) {
        ;
    }
}

//*****************************************************************************
// Default core exception handlers. Override the ones here by defining your own
// handler routines in your application code.
//*****************************************************************************
WEAK_AV void NMI_Handler(void)
{ while(1) {}
}

WEAK_AV void HardFault_Handler(void)
{ while(1) {}
}

WEAK_AV void MemManage_Handler(void)
{ while(1) {}
}

WEAK_AV void BusFault_Handler(void)
{ while(1) {}
}

WEAK_AV void UsageFault_Handler(void)
{ while(1) {}
}

WEAK_AV void SecureFault_Handler(void)
{ while(1) {}
}

WEAK_AV void SVC_Handler(void)
{ while(1) {}
}

WEAK_AV void DebugMon_Handler(void)
{ while(1) {}
}

WEAK_AV void PendSV_Handler(void)
{ while(1) {}
}

WEAK_AV void SysTick_Handler(void)
{ while(1) {}
}

//*****************************************************************************
// Processor ends up here if an unexpected interrupt occurs or a specific
// handler is not present in the application code.
//*****************************************************************************
WEAK_AV void IntDefaultHandler(void)
{ while(1) {}
}

//*****************************************************************************
// Default application exception handlers. Override the ones here by defining
// your own handler routines in your application code. These routines call
// driver exception handlers or IntDefaultHandler() if no driver exception
// handler is included.
//*****************************************************************************
WEAK void Reserved16_IRQHandler(void)
{   Reserved16_DriverIRQHandler();
}

WEAK void Reserved17_IRQHandler(void)
{   Reserved17_DriverIRQHandler();
}

WEAK void Reserved18_IRQHandler(void)
{   Reserved18_DriverIRQHandler();
}

WEAK void FRO2_IRQHandler(void)
{   FRO2_DriverIRQHandler();
}

WEAK void GLIKEY4_IRQHandler(void)
{   GLIKEY4_DriverIRQHandler();
}

WEAK void UTICK1_IRQHandler(void)
{   UTICK1_DriverIRQHandler();
}

WEAK void MRT1_IRQHandler(void)
{   MRT1_DriverIRQHandler();
}

WEAK void CTIMER5_IRQHandler(void)
{   CTIMER5_DriverIRQHandler();
}

WEAK void CTIMER6_IRQHandler(void)
{   CTIMER6_DriverIRQHandler();
}

WEAK void CTIMER7_IRQHandler(void)
{   CTIMER7_DriverIRQHandler();
}

WEAK void LPI2C15_IRQHandler(void)
{   LPI2C15_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM17_IRQHandler(void)
{   LP_FLEXCOMM17_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM18_IRQHandler(void)
{   LP_FLEXCOMM18_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM19_IRQHandler(void)
{   LP_FLEXCOMM19_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM20_IRQHandler(void)
{   LP_FLEXCOMM20_DriverIRQHandler();
}

WEAK void ADC_IRQHandler(void)
{   ADC_DriverIRQHandler();
}

WEAK void SDADC_IRQHandler(void)
{   SDADC_DriverIRQHandler();
}

WEAK void GLIKEY1_IRQHandler(void)
{   GLIKEY1_DriverIRQHandler();
}

WEAK void ACMP_IRQHandler(void)
{   ACMP_DriverIRQHandler();
}

WEAK void PDM_EVENT_IRQHandler(void)
{   PDM_EVENT_DriverIRQHandler();
}

WEAK void HYPERVISOR_IRQHandler(void)
{   HYPERVISOR_DriverIRQHandler();
}

WEAK void SECURE_VIOLATION_IRQHandler(void)
{   SECURE_VIOLATION_DriverIRQHandler();
}

WEAK void PDM_HWVAD_EVENT_IRQHandler(void)
{   PDM_HWVAD_EVENT_DriverIRQHandler();
}

WEAK void RTC1_ALARM_IRQHandler(void)
{   RTC1_ALARM_DriverIRQHandler();
}

WEAK void RTC1_IRQHandler(void)
{   RTC1_DriverIRQHandler();
}

WEAK void HIFI1_IRQHandler(void)
{   HIFI1_DriverIRQHandler();
}

WEAK void MU1_B_IRQHandler(void)
{   MU1_B_DriverIRQHandler();
}

WEAK void MU2_B_IRQHandler(void)
{   MU2_B_DriverIRQHandler();
}

WEAK void MU3_A_IRQHandler(void)
{   MU3_A_DriverIRQHandler();
}

WEAK void PMC_IRQHandler(void)
{   PMC_DriverIRQHandler();
}

WEAK void OS_EVENT_IRQHandler(void)
{   OS_EVENT_DriverIRQHandler();
}

WEAK void USDHC0_IRQHandler(void)
{   USDHC0_DriverIRQHandler();
}

WEAK void USDHC1_IRQHandler(void)
{   USDHC1_DriverIRQHandler();
}

WEAK void I3C2_IRQHandler(void)
{   I3C2_DriverIRQHandler();
}

WEAK void USB0_IRQHandler(void)
{   USB0_DriverIRQHandler();
}

WEAK void USB1_IRQHandler(void)
{   USB1_DriverIRQHandler();
}

WEAK void WDT2_IRQHandler(void)
{   WDT2_DriverIRQHandler();
}

WEAK void WDT3_IRQHandler(void)
{   WDT3_DriverIRQHandler();
}

WEAK void USBPHY0_IRQHandler(void)
{   USBPHY0_DriverIRQHandler();
}

WEAK void PMIC_IRQN_IRQHandler(void)
{   PMIC_IRQN_DriverIRQHandler();
}

WEAK void I3C3_IRQHandler(void)
{   I3C3_DriverIRQHandler();
}

WEAK void FLEXIO_IRQHandler(void)
{   FLEXIO_DriverIRQHandler();
}

WEAK void LCDIF_IRQHandler(void)
{   LCDIF_DriverIRQHandler();
}

WEAK void VGPU_IRQHandler(void)
{   VGPU_DriverIRQHandler();
}

WEAK void MIPI_IRQHandler(void)
{   MIPI_DriverIRQHandler();
}

WEAK void EDMA2_CH0_IRQHandler(void)
{   EDMA2_CH0_DriverIRQHandler();
}

WEAK void EDMA2_CH1_IRQHandler(void)
{   EDMA2_CH1_DriverIRQHandler();
}

WEAK void EDMA2_CH2_IRQHandler(void)
{   EDMA2_CH2_DriverIRQHandler();
}

WEAK void EDMA2_CH3_IRQHandler(void)
{   EDMA2_CH3_DriverIRQHandler();
}

WEAK void EDMA2_CH4_IRQHandler(void)
{   EDMA2_CH4_DriverIRQHandler();
}

WEAK void EDMA2_CH5_IRQHandler(void)
{   EDMA2_CH5_DriverIRQHandler();
}

WEAK void EDMA2_CH6_IRQHandler(void)
{   EDMA2_CH6_DriverIRQHandler();
}

