nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/mcuxpresso/startup_mimxrt798s_cm33_core1.cpp
WEAK void EDMA2_CH7_IRQHandler(void)
{   EDMA2_CH7_DriverIRQHandler();
}

WEAK void EDMA3_CH0_IRQHandler(void)
{   EDMA3_CH0_DriverIRQHandler();
}

WEAK void EDMA3_CH1_IRQHandler(void)
{   EDMA3_CH1_DriverIRQHandler();
}

WEAK void EDMA3_CH2_IRQHandler(void)
{   EDMA3_CH2_DriverIRQHandler();
}

WEAK void EDMA3_CH3_IRQHandler(void)
{   EDMA3_CH3_DriverIRQHandler();
}

WEAK void EDMA3_CH4_IRQHandler(void)
{   EDMA3_CH4_DriverIRQHandler();
}

WEAK void EDMA3_CH5_IRQHandler(void)
{   EDMA3_CH5_DriverIRQHandler();
}

WEAK void EDMA3_CH6_IRQHandler(void)
{   EDMA3_CH6_DriverIRQHandler();
}

WEAK void EDMA3_CH7_IRQHandler(void)
{   EDMA3_CH7_DriverIRQHandler();
}

WEAK void GPIO80_IRQHandler(void)
{   GPIO80_DriverIRQHandler();
}

WEAK void GPIO81_IRQHandler(void)
{   GPIO81_DriverIRQHandler();
}

WEAK void GPIO90_IRQHandler(void)
{   GPIO90_DriverIRQHandler();
}

WEAK void GPIO91_IRQHandler(void)
{   GPIO91_DriverIRQHandler();
}

WEAK void GPIO100_IRQHandler(void)
{   GPIO100_DriverIRQHandler();
}

WEAK void GPIO101_IRQHandler(void)
{   GPIO101_DriverIRQHandler();
}

WEAK void Reserved83_IRQHandler(void)
{   Reserved83_DriverIRQHandler();
}

WEAK void Reserved84_IRQHandler(void)
{   Reserved84_DriverIRQHandler();
}

WEAK void PIN_INT0_IRQHandler(void)
{   PIN_INT0_DriverIRQHandler();
}

WEAK void PIN_INT1_IRQHandler(void)
{   PIN_INT1_DriverIRQHandler();
}

WEAK void PIN_INT2_IRQHandler(void)
{   PIN_INT2_DriverIRQHandler();
}

WEAK void PIN_INT3_IRQHandler(void)
{   PIN_INT3_DriverIRQHandler();
}

WEAK void SAI3_IRQHandler(void)
{   SAI3_DriverIRQHandler();
}

WEAK void XSPI2_IRQHandler(void)
{   XSPI2_DriverIRQHandler();
}

WEAK void MMU2_IRQHandler(void)
{   MMU2_DriverIRQHandler();
}

WEAK void GDET2_IRQHandler(void)
{   GDET2_DriverIRQHandler();
}

WEAK void GDET3_IRQHandler(void)
{   GDET3_DriverIRQHandler();
}

WEAK void CDOG3_IRQHandler(void)
{   CDOG3_DriverIRQHandler();
}

WEAK void CDOG4_IRQHandler(void)
{   CDOG4_DriverIRQHandler();
}

WEAK void Reserved96_IRQHandler(void)
{   Reserved96_DriverIRQHandler();
}

WEAK void CPU1_IRQHandler(void)
{   CPU1_DriverIRQHandler();
}

WEAK void JPEGDEC_IRQHandler(void)
{   JPEGDEC_DriverIRQHandler();
}

WEAK void PNGDEC_IRQHandler(void)
{   PNGDEC_DriverIRQHandler();
}

WEAK void Reserved100_IRQHandler(void)
{   Reserved100_DriverIRQHandler();
}

WEAK void TEMPDET0_IRQHandler(void)
{   TEMPDET0_DriverIRQHandler();
}

WEAK void TEMPDET1_IRQHandler(void)
{   TEMPDET1_DriverIRQHandler();
}

WEAK void EZHV_IRQHandler(void)
{   EZHV_DriverIRQHandler();
}

WEAK void SLEEPCON1_IRQHandler(void)
{   SLEEPCON1_DriverIRQHandler();
}

WEAK void PVTS1_CPU1_IRQHandler(void)
{   PVTS1_CPU1_DriverIRQHandler();
}

WEAK void Reserved106_IRQHandler(void)
{   Reserved106_DriverIRQHandler();
}

WEAK void PVTS1_HIFI1_IRQHandler(void)
{   PVTS1_HIFI1_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
